/* global test, expect */

import {getCausative} from '../src';

test.each([
	['Γιώργος', 'Γιώργο'],
	['Ιωάννης', 'Ιωάννη'],
	['Μιχάλης', 'Μιχάλη'],
	['Παναγής', 'Παναγή'],
	['Κώστας', 'Κώστα'],
	['Παρασκευάς', 'Παρασκευά'],
	['Άδωνις', 'Άδωνι'],
	['Αδωνίς', 'Αδωνί'],
	['Κωσταντίνος', 'Κωσταντίνο'],
	['Κωσταντινος', 'Κωσταντινο'],
	['Αρχαίος', 'Αρχαίο'],
	['Αρχαιος', 'Αρχαιο'],
	['Χριστόφορος', 'Χριστόφορο'],
	['Χριστοφορος', 'Χριστοφορο'],
	['Εδουάρδος', 'Εδουάρδο'],
	['Αριστόνους', 'Αριστόνου'],
	['Αετιδεύς', 'Αετιδεύ'],
	['Ζευς', 'Ζευ'],
	['Βίκτωρ', 'Βίκτωρα'],
	['Σχολείο', 'Σχολείο']
])(
	'male causative for (%s)',
	(input, expected) => {
		expect(getCausative(input)).toBe(expected);
	}
);

test.each([
	['Μαρία', 'Μαρία'],
	['Άρτεμις', 'Άρτεμη']
])(
	'female causative for (%s)',
	(name, expected) => {
		expect(getCausative(name)).toBe(expected);
	}
);
